Repository: olea/LuCAS
Catalog: doc-man-1-dd/po/*.po
Languages: es

source: convert and copy a file
es: convertir y copiar un fichero

source: if=file
es: if=fichero

source: of=file
es: of=fichero

source: skip=blocks
es: skip=bloques

source: seek=blocks
es: seek=bloques

source: count=blocks
es: count=bloques

source: DESCRIPTION
es: DESCRIPCIÓN

source: <command>dd</command> copies a file (from standard input to standard output, by default) using specific input and output blocksizes, while optionally performing conversions on it.
es: <command>dd</command> copia un fichero (de la entrada estándar a la salida estándar, por omisión) con un tamaño de bloque seleccionable por el usuario, a la par que, opcionalmente, realiza sobre él ciertas conversiones.

source: It reads the input one block at a time, using the specified input block size (the default is 512 bytes). If the <emphasis remap="B">bs=</emphasis><emphasis remap="I">bytes</emphasis> option was given, and no conversion other than <emphasis remap="B">sync</emphasis>, <emphasis remap="B">noerror</emphasis>, or <emphasis remap="B">notrunc</emphasis> was specified, it writes the amount of data read (which could be smaller than what was requested) in a separate output block. This output block has precisely the same length as was read unless the <emphasis remap="B">sync</emphasis> conversion was specified, in which case the data is padded with NULs (or spaces, see below).
es: Lee la entrada un bloque cada vez, usando el tamaño de bloque de entrada especificado (el valor predeterminado es 512 bytes). Si se dio la opción <emphasis remap="B">bs=</emphasis><emphasis remap="I">bytes</emphasis> y no se especificó otra conversión aparte de <emphasis remap="B">sync</emphasis>, <emphasis remap="B">noerror</emphasis>, o <emphasis remap="B">notrunc</emphasis>, escribe la cantidad de datos leídos (que puede ser menor que la solicitada) en un bloque de salida separado. Este bloque de salida tiene precisamente la misma longitud que fue leída a menos que se especificara la conversión <emphasis remap="B">sync</emphasis>, en cuyo caso, los datos se rellenan con NULos (o espacios, véase debajo).

source: Otherwise, the input, read one block at a time, is processed and the resulting output is collected and written in blocks of the specified output block size. The final output block may be shorter.
es: De otro modo, la entrada, leída un bloque de cada vez, se procesa t la salida resultante es recogida y escrita en bloques del tamaño de bloque de salida especificado. El último bloque de salida puede ser más corto.

source: The numeric-valued options below (bytes and blocks) can be followed by a multiplier: `k'=1024, `b'=512, `w'=2, `c'=1 (`w' and `c' are GNU extensions; `w' should never be used - it means 2 in System V and 4 in 4.2BSD). Two or more of such numeric expressions can be multiplied by putting `x' in between. The GNU fileutils-4.0 version also allows the following multiplicative suffixes in the specification of blocksizes (in bs=, cbs=, ibs=, obs=): M=1048576, G=1073741824, and so on for T, P, E, Z, Y. A `D' suffix makes them decimal: kD=1000, MD=1000000, GD=1000000000, etc. (Note that for ls, df, du the size of M etc. is determined by environment variables, but for dd it is fixed.)
es: Las opciones de más abajo con valores numéricos (bytes y bloques) pueden ir seguidas por un factor multiplicador: ‘k’=1024, ‘b’=512, ‘w’=2, ‘c’=1 (‘w’ y ‘c’ son extensiones de GNU; ‘w’ nunca debería utilizarse: significa 2 en System V y 4 en 4.2BSD). Dos o más de tales expresiones numéricas pueden multiplicarse poniendo una ‘x’ (equis minúscula) entre ellas. La versión fileutils‐4.0 de GNU también permite los siguientes sufijos multiplicativos al especificar tamaños de bloque (en bs=, cbs=, ibs=, obs=): M=1048576, G=1073741824, y así para T, P, E, Z, Y. Un sufijo ‘D’ los convierte en decimal: kD=1000, MD=1000000, GD=1000000000, etc. (Dese cuenta que para ls, df, du, el tamaño de M, etc., viene determinado por variables de entorno, pero para dd es fijo.)

source: OPTIONS
es: OPCIONES

source: <emphasis remap="B">if=</emphasis><emphasis remap="I">file</emphasis>
es: <emphasis remap="B">if= </emphasis><emphasis remap="I">fichero</emphasis>

source: Read from <emphasis remap="I">file</emphasis> instead of standard input.
es: Lee desde <emphasis remap="I">fichero</emphasis> en lugar de desde la entrada estándar.

source: <emphasis remap="B">of=</emphasis><emphasis remap="I">file</emphasis>
es: <emphasis remap="B">of=</emphasis><emphasis remap="I">fichero</emphasis>

source: Write to <emphasis remap="I">file</emphasis> instead of standard output. Unless <emphasis remap="B">conv=notrunc</emphasis> is given, <command>dd</command> truncates <emphasis remap="I">file</emphasis> to zero bytes (or the size specified with <emphasis remap="B">seek=</emphasis>).
es: Escribe a <emphasis remap="I">fichero</emphasis> en lugar de a la salida estándar. A menos que <emphasis remap="B">conv=notrunc</emphasis> se de, <command>dd</command> trunca <emphasis remap="I">fichero</emphasis> a cero bytes (o el tamaño especificado con <emphasis remap="B">seek=</emphsis>).

source: Read <emphasis remap="I">bytes</emphasis> bytes at a time. The default is 512.
es: Lee <emphasis remap="I">bytes</emphasis> bytes de una vez. El valor predeterminado es 512.

source: Write <emphasis remap="I">bytes</emphasis> bytes at a time. The default is 512.
es: Escribe <emphasis remap="I">bytes</emphasis> bytes de una vez. El valor predeterminado es 512.

source: Both read and write <emphasis remap="I">bytes</emphasis> bytes at a time. This overrides <emphasis remap="B">ibs</emphasis> and <emphasis remap="B">obs</emphasis>. (And setting <emphasis remap="B">bs</emphasis> is not equivalent with setting both <emphasis remap="B">ibs</emphasis> and <emphasis remap="B">obs</emphasis> to this same value, at least when no conversion other than <emphasis remap="B">sync</emphasis>, <emphasis remap="B">noerror</emphasis> and <emphasis remap="B">notrunc</emphasis> is specified, since it stipulates that each input block shall be copied to the output as a single block without aggregating short blocks.)
es: Lee y escribe <emphasis remap="I">bytes</emphasis> bytes cada vez. Esto sustituye a <emphasis remap="B">ibs</emphasis> y <emphasis remap="B">obs</emphasis>. (Y poner <emphasis remap="B">bs</emphasis> no es equivalente a poner <emphasis remap="B">ibs</emphasis> y <emphasis remap="B">obs</emphasis> al mismo valor, al menos si no se ha especificado una conversión aparte de <emphasis remap="B">sync</emphasis>, <emphasis remap="B">noerror</emphasis> y <emphasis remap="B">notrunc</emphasis>, puesto que se estipula que cada bloque de entrada será copiado en la salida como un único bloque, sin agregar bloques cortos.)

source: Specify the conversion block size for <emphasis remap="B">block</emphasis> and <emphasis remap="B">unblock</emphasis>.
es: Especifica el tamaño de bloque de conversión para <emphasis remap="B">block</emphasis> y <emphasis remap="B">unblock</emphasis>.

source: <emphasis remap="B">skip=</emphasis><emphasis remap="I">blocks</emphasis>
es: <emphasis remap="B">skip=</emphasis><emphasis remap="I">bloques</emphasis>

source: Skip <emphasis remap="I">blocks</emphasis><emphasis remap="B">ibs</emphasis>-byte blocks in the input file before copying.
es: Salta <emphasis remap="I">bloques</emphasis> bloques de tamaño en bytes determinado por <emphasis remap="B">ibs</emphasis> del fichero de entrada antes de la copia.

source: <emphasis remap="B">seek=</emphasis><emphasis remap="I">blocks</emphasis>
es: <emphasis remap="B">seek=</emphasis><emphasis remap="I">bloques</emphasis>

source: Skip <emphasis remap="I">blocks</emphasis><emphasis remap="B">obs</emphasis>-byte blocks in the output file before copying.
es: Salta <emphasis remap="I">bloques</emphasis> bloques de tamaño en bytes determinado por <emphasis remap="B">obs</emphasis> en el fichero de salida antes de la copia.

source: <emphasis remap="B">count=</emphasis><emphasis remap="I">blocks</emphasis>
es: <emphasis remap="B">count=</emphasis><emphasis remap="I">bloques</emphasis>

source: Copy <emphasis remap="I">blocks</emphasis><emphasis remap="B">ibs</emphasis>-byte blocks from the input file, instead of everything until the end of the file.
es: Copia <emphasis remap="I">bloques</emphasis> bloques de tamaño en bytes determinado por <emphasis remap="B">ibs</emphasis> del fichero de entrada, en vez de todo hasta el final del fichero.

source: <emphasis remap="B">conv=</emphasis><emphasis remap="I">CONVERSION</emphasis><emphasis remap="B">[,</emphasis><emphasis remap="I">CONVERSION</emphasis><emphasis remap="B">]...</emphasis>
es: <emphasis remap="B">conv=</emphasis><emphasis remap="I">CONVERSIÓN</emphasis><emphasis remap="B">[,</emphasis><emphasis remap="I">CONVERSIÓN</emphasis><emphasis remap="B">]...</emphasis>

source: Convert the file as specified by the <emphasis remap="I">CONVERSION</emphasis> argument(s). (No spaces around any comma(s).)
es: Convierte el fichero según se haya especificado en el o los argumentos <emphasis remap="I">CONVERSIÓN</emphasis>. (No se permite ningún espacio al lado de ninguna coma.)

source: Conversions:
es: Conversiones:

source: Convert EBCDIC to ASCII.
es: Convierte EBCDIC a ASCII.

source: Convert ASCII to EBCDIC.
es: Convierte ASCII a EBCDIC.

source: Convert ASCII to alternate EBCDIC.
es: Convierte ASCII a un EBCDIC alternativo.

source: For each line in the input, output <emphasis remap="B">cbs</emphasis> bytes, replacing the input newline with a space and padding with spaces as necessary.
es: Para cada línea de la entrada, saca <emphasis remap="B">cbs</emphasis> bytes, reemplazando el salto de línea de la entrada con un espacio y rellenando con más espacios si fuera necesario.

source: Replace trailing spaces in each <emphasis remap="B">cbs</emphasis>-sized input block with a newline.
es: Reemplaza espacios del final en cada bloque de entrada de tamaño determinado por <emphasis remap="B">cbs</emphasis> por un salto de línea.

source: Change uppercase letters to lowercase.
es: Cambia las letras mayúsculas por minúsculas.

source: Change lowercase letters to uppercase.
es: Cambia las letras minúsculas por mayúsculas.

source: Swap every pair of input bytes. If an odd number of bytes are read the last byte is simply copied (since there is nothing to swap it with). [POSIX 1003.2b, PASC interpretations 1003.2 #3 and #4]
es: Intercambia cada par de bytes de la entrada. Si se lee un número impar de bytes el último byte se copia tal cual (ya que no tiene con quién intercambiarse). [POSIX 1003.2b, PASC interpretaciones 1003.2 nº 3 y nº 4]

source: Continue after read errors.
es: Continúa despues de producirse errores de lectura.

source: Do not truncate the output file.
es: No trunca el fichero de salida.

source: Pad every input block to size of <emphasis remap="B">ibs</emphasis> with trailing zero bytes.
es: Rellena cada bloque de entrada hasta el tamaño determinado por <emphasis remap="B">ibs</emphasis> con bytes cero al final.

source: GNU STANDARD OPTIONS
es: OPCIONES ESTÁNDAR DE GNU

source: Print a usage message on standard output and exit successfully.
es: Muestra un mensaje en la salida estándar sobre el modo de empleo y acaba con código de éxito.

source: Print version information on standard output, then exit successfully.
es: Muestra en la salida estándar información sobre la versión y luego acaba con código de éxito.

source: Terminate option list.
es: Termina la lista de opciones.

source: ENVIRONMENT
es: ENTORNO

source: The variables LANG, LC_ALL, LC_CTYPE and LC_MESSAGES have the usual meaning.
es: Las variables LANG, LC_ALL, LC_TYPE y LC_MESSAGES tienen el significado habitual.

source: CONFORMING TO
es: CONFORME A

source: EXAMPLE
es: EJEMPLO

source: Often a tape drive will not accept arbitrarily sized blocks, and <command>dd</command> would get an I/O error for the last fragment of data that does not fill an entire block. Use `dd if=myfile of=/dev/mytape conv=sync' to get everything on tape. Of course, reading it back will now produce a slightly larger file, with nulls added at the end.
es: A menudo, una unidad de cinta no aceptará bloques de tamaño arbitrario y <command>dd</command> obtendrá un error de E/S en el último fragmento de datos que no ocupe un bloque entero. Use ‘dd if=mifichero of=/dev/miunidaddecinta conv=sync’ para asegurarse de que todo se ha grabado en la cinta. Naturalmente, leerla de nuevo producirá ahora un fichero ligeramente más grande, con caracteres nulos añadidos al final.

source: BUGS
es: ERRORES

source: Commands like `dd if=myfile of=/dev/fd0 bs=1k seek=172' fail on some systems because <command>dd</command> tries to truncate the output file, but truncation of a block device is not possible. In such cases, add the `conv=notrunc' option.
es: Comandos como `dd if=mifichero of=/dev/fd0 bs=1k seek=172' fallan en algunos sistemas porque <command>dd</command> intenta truncar el fichero de salida, pero el truncado de un dispositivo de bloques no es posible. En dichos casos, añádase la opción `conv=notrunc'.

source: NOTES
es: NOTAS

source: This page describes <command>dd</command> as found in the fileutils-4.0 package; other versions may differ slightly.
es: Esta página describe <command>dd</command> como se encuentra en el paquete fileutils-4.0; otras versiones pueden diferir ligeramente.

source: translator-credits
es: créditos de traductor
