Repository: olea/LuCAS
Catalog: doc-man-1-diff/po/*.po
Languages: es

source: GNU Tools
es: Herramientas de GNU

source: find differences between two files
es: encuentra diferencias entre dos ficheros

source: options
es: opciones

source: from-file
es: fichero-origen

source: to-file
es: fichero-destino

source: DESCRIPTION
es: DESCRIPCIÓN

source: In the simplest case, <command>diff</command> compares the contents of the two files <emphasis remap="I">from-file</emphasis> and <emphasis remap="I">to-file</emphasis>. A file name of <emphasis remap="B">-</emphasis> stands for text read from the standard input. As a special case, <userinput>diff - -</userinput> compares a copy of standard input to itself.
es: En el caso más simple, <command>diff</command> compara los contenidos de los dos ficheros <emphasis remap="I">fichero-origen</emphasis> y <emphasis remap="I">fichero-destino</emphasis>. Un nombre de fichero <emphasis remap="B">-</emphasis> significa texto leído desde la entrada estándar. Como un caso especial, <userinput>diff - -</userinput> compara una copia de la entrada estándar consigo misma.

source: If <emphasis remap="I">from-file</emphasis> is a directory and <emphasis remap="I">to-file</emphasis> is not, <command>diff</command> compares the file in <emphasis remap="I">from-file</emphasis> whose file name is that of <emphasis remap="I">to-file</emphasis>, and vice versa. The non-directory file must not be <emphasis remap="B">-</emphasis>.
es: Si <emphasis remap="I">fichero-origen</emphasis> es un directorio y <emphasis remap="I">fichero-destino</emphasis> no lo es, <command>diff</command> compara el fichero en <emphasis remap="I">fichero-origen</emphasis> cuyo nombre sea igual que el de <emphasis remap="I">fichero-destino</emphasis>, y viceversa. El fichero no directorio no puede ser <emphasis remap="B">-</emphasis>.

source: If both <emphasis remap="I">from-file</emphasis> and <emphasis remap="I">to-file</emphasis> are directories, <command>diff</command> compares corresponding files in both directories, in alphabetical order; this comparison is not recursive unless the <option>-r</option> or <option>--recursive</option> option is given. <command>diff</command> never compares the actual contents of a directory as if it were a file. The file that is fully specified may not be standard input, because standard input is nameless and the notion of file with the same name does not apply.
es: Si tanto <emphasis remap="I">fichero-origen</emphasis> como <emphasis remap="I">fichero-destino</emphasis> son directorios, <command>diff</command> compara ficheros correspondientes en ambos directorios, en orden alfabético; esta comparación no es recursiva, a menos que se hayan dado las opciones <option>-r</option> o <option>--recursive</option>. <command>diff</command> nunca compara los contenidos reales de un directorio como si fuera un archivo. El fichero que se especifique completamente no puede ser la entrada estándar, porque la entrada estándar no tiene nombre y la noción de 'fichero con el mismo nombre' no puede aplicarse.

source: <command>diff</command> options begin with <emphasis remap="B">-</emphasis>, so normally <emphasis remap="I">from-file</emphasis> and <emphasis remap="I">to-file</emphasis> may not begin with <emphasis remap="B">-</emphasis>. However, <option>--</option> as an argument by itself treats the remaining arguments as file names even if they begin with <emphasis remap="B">-</emphasis>.
es: Las opciones de <command>diff</command> comienzan por <emphasis remap="B">-</emphasis>, de modo que normalmente <emphasis remap="I">fichero-origen</emphasis> y <emphasis remap="I">fichero-destino</emphasis> no pueden comenzar por <emphasis remap="B">-</emphasis>. Sin embargo, <option>--</option> como un argumento solo, trata los restantes argumentos como nombres de fichero, incluso si comienzan por <emphasis remap="B">-</emphasis>.

source: Options
es: Opciones

source: Below is a summary of all of the options that GNU <command>diff</command> accepts. Most options have two equivalent names, one of which is a single letter preceded by <emphasis remap="B">-</emphasis>, and the other of which is a long name preceded by <option>--</option>. Multiple single letter options (unless they take an argument) can be combined into a single command line word: <option>-ac</option> is equivalent to <option>-a -c</option>. Long named options can be abbreviated to any unique prefix of their name. Brackets (<emphasis remap="B">[</emphasis> and <emphasis remap="B">]</emphasis>) indicate that an option takes an optional argument.
es: A continuación se presenta un sumario de todas las opciones que acepta <command>diff</command> de GNU. La mayoría de las opciones tienen dos nombres equivalentes, uno de los cuales es una única letra precedida por <emphasis remap="B">-<emphasis>, y el otro es un nombre largo precedido por <option>--</option>. Varias opciones de una sola letra (a menos que tomen un argumento) pueden combinarse en una sola palabra de la línea de comandos: <option>-ac</option> es equivalente a <option>-a -c</option>. Las opciones largas pueden abreviarse a un prefijo único de su nombre. Los corchetes (<emphasis remap="B">[</emphasis> y <emphasis remap="B">]</emphasis>) indican que una opción toma un argumento opcional.

source: <emphasis remap="B">-</emphasis><emphasis remap="I">lines</emphasis>
es: <emphasis remap="B">-</emphasis><emphasis remap="I">líneas</emphasis>

source: Show <emphasis remap="I">lines</emphasis> (an integer) lines of context. This option does not specify an output format by itself; it has no effect unless it is combined with <option>-c</option> or <option>-u</option>. This option is obsolete. For proper operation, <emphasis remap="I">patch</emphasis> typically needs at least two lines of context.
es: Muestra <emphasis remap="I">líneas</emphasis> (un entero) líneas de contexto. Esta opción no especifica un formato de salida por si misma; no tiene efecto a menos que se combine con <option>-c</option> o <option>-u</option>. Esta opción está obsoleta. Para una operación correcta, <emphasis remap="I">patch</emphasis> necesita típicamente al menos dos líneas de contexto.

source: Treat all files as text and compare them line-by-line, even if they do not seem to be text.
es: Trata todos los ficheros como texto y los compara línea por línea, incluso si no parecen ser de texto.

source: Ignore changes in amount of white space.
es: Hace caso omiso de cambios referentes a la cantidad de espacio en blanco.

source: Ignore changes that just insert or delete blank lines.
es: No hace caso de cambios consistentes en sólo insertar o borrar líneas en blanco.

source: Report only whether the files differ, not the details of the differences.
es: Informa solamente de si los ficheros difieren, no acerca de los detalles de las diferencias.

source: Use the context output format.
es: Emplea el formato de salida de contexto.

source: <option>-C </option><emphasis remap="I">lines</emphasis>
es: <option>-C </option><emphasis remap="I">líneas</emphasis>

source: <option>--context[=</option><replaceable>lines</replaceable><emphasis remap="B">]</emphasis>
es: <option>--context[=</option><replaceable>líneas</replaceable><emphasis remap="B">]</emphasis>

source: Use the context output format, showing <emphasis remap="I">lines</emphasis> (an integer) lines of context, or three if <emphasis remap="I">lines</emphasis> is not given. For proper operation, <emphasis remap="I">patch</emphasis> typically needs at least two lines of context.
es: Emplea el formato de salida de contexto, mostrando <emphasis remap="I">líneas</emphasis> (un entero) líneas de contexto, o tres líneas <emphasis remap="I">líneas</emphasis>si no se da. Para una operación correcta, <emphasis remap="I">patch</emphasis> necesita típicamente al menos dos líneas de contexto.

source: <option>--changed-group-format=</option><replaceable>format</replaceable>
es: <option>--changed-group-format=</option><replaceable>formato</replaceable>

source: Use <emphasis remap="I">format</emphasis> to output a line group containing differing lines from both files in if-then-else format.
es: Emplea <emphasis remap="I">formato</emphasis> para mostrar un grupo de líneas conteniendo líneas que difieren en ambos ficheros, en formato if-then-else (si-entonces-en otro caso).

source: Change the algorithm to perhaps find a smaller set of changes. This makes <command>diff</command> slower (sometimes much slower).
es: Cambia el algoritmo para quizás encontrar un conjunto de cambios más pequeños. Esto hace que <command>diff</command> sea más lento (a veces mucho más lento).

source: <option>-D </option><emphasis remap="I">name</emphasis>
es: <option>-D </option><emphasis remap="I">nombre</emphasis>

source: Make merged if-then-else format output, conditional on the preprocessor macro <emphasis remap="I">name</emphasis>.
es: Construye la salida en formato if-then-else mezclada. condicional según la macro del preprocesador <emphasis remap="I">nombre</emphasis>.

source: Make output that is a valid <emphasis remap="I">ed</emphasis> script.
es: Construye la salida como un guión de <emphasis remap="I">ed</emphasis> válido.

source: <option>--exclude=</option><replaceable>pattern</replaceable>
es: <option>--exclude=</option><replaceable>patrón</replaceable>

source: When comparing directories, ignore files and subdirectories whose basenames match <emphasis remap="I">pattern</emphasis>.
es: Cuando se comparen directorios, ignorar ficheros y subdirectorios cuyos nombres base concuerden con <emphasis remap="I">patrón</emphasis>.

source: <option>--exclude-from=</option><replaceable>file</replaceable>
es: <option>--exclude-from=</option><replaceable>fichero</replaceable>

source: When comparing directories, ignore files and subdirectories whose basenames match any pattern contained in <emphasis remap="I">file</emphasis>.
es: Cuando se comparen directorios, ignorar ficheros y subdirectorios cuyos nombres base concuerden con cualquier patrón contenido en <emphasis remap="I">fichero</emphasis>.

source: Expand tabs to spaces in the output, to preserve the alignment of tabs in the input files.
es: Expande tabulaciones a espacios en la salida, para preservar el alineamiento de tabulaciones en los ficheros de entrada.

source: Make output that looks vaguely like an <emphasis remap="I">ed</emphasis> script but has changes in the order they appear in the file.
es: Construye una salida que se parece vagamente a un guión del editor <emphasis remap="I">ed</emphasis> pero tiene cambios en el orden en que aparecen el en fichero.

source: <option>-F </option><emphasis remap="I">regexp</emphasis>
es: <option>-F </option><emphasis remap="I">expreg</emphasis>

source: In context and unified format, for each hunk of differences, show some of the last preceding line that matches <emphasis remap="I">regexp</emphasis>.
es: En formatos de contexto y unificado, por cada pedazo de diferencias, muestra algo de la última línea precedente que concuerde con la expresión regular <emphasis remap="I">expreg</emphasis>.

source: Make output that looks vaguely like an <emphasis remap="B">ed</emphasis> script but has changes in the order they appear in the file.
es: Construye una salida que se parece vagamente a un guión de <emphasis remap="B">ed</emphasis> pero que tiene cambios en el orden en que aparecen en el fichero.

source: This option currently has no effect; it is present for Unix compatibility.
es: Actualmente, esta opción no tiene ningún efecto; está presente por compatibilidad con Unix.

source: Use heuristics to speed handling of large files that have numerous scattered small changes.
es: Emplea heurísticas para agilizar el manejo de ficheros grandes que tienen numerosos cambios pequeños dispersos.

source: <option>--horizon-lines=</option><replaceable>lines</replaceable>
es: <option>--horizon-lines=</option><replaceable>líneas</replaceable>

source: Do not discard the last <emphasis remap="I">lines</emphasis> lines of the common prefix and the first <emphasis remap="I">lines</emphasis> lines of the common suffix.
es: No descartar las últimas <emphasis remap="I">líneas</emphasis> líneas del prefijo común y las primeras <emphasis remap="I">líneas</emphasis> líneas del sufijo común.

source: Ignore changes in case; consider upper- and lower-case letters equivalent.
es: Ignora cambios en la caja tipográfica; considera las letras mayúsculas y minúsculas equivalentes.

source: <option>-I </option><emphasis remap="I">regexp</emphasis>
es: <option>-I </option><emphasis remap="I">expreg</emphasis>

source: Ignore changes that just insert or delete lines that match <emphasis remap="I">regexp</emphasis>.
es: Ignora cambios que sólo insertan o borran líneas que concuerden con la expresión regular <emphasis remap="I">expreg</emphasis>.

source: <option>--ifdef=</option><replaceable>name</replaceable>
es: <option>--ifdef=</option><replaceable>nombre</replaceable>

source: Ignore white space when comparing lines.
es: Ignora espacios en blanco al comparar líneas.

source: Ignore changes in case; consider upper- and lower-case to be the same.
es: Ignora cambios en la caja tipográfica; considera las letras mayúsculas y minúsculas equivalentes.

source: <option>--ignore-matching-lines=</option><replaceable>regexp</replaceable>
es: <option>--ignore-matching-lines=</option><replaceable>expreg</replaceable>

source: Output a tab rather than a space before the text of a line in normal or context format. This causes the alignment of tabs in the line to look normal.
es: Muestra en la salida una tabulación en lugar de un espacio antes del texto de una línea en formato normal o de contexto. Esto hace que el alineamiento de las tabulaciones en la línea se vea normal.

source: Pass the output through <emphasis remap="I">pr</emphasis> to paginate it.
es: Pasa la salida a través de <emphasis remap="I">pr</emphasis> para paginarla.

source: <option>-L </option><emphasis remap="I">label</emphasis>
es: <option>-L </option><emphasis remap="I">etiqueta</emphasis>

source: <option>--label=</option><replaceable>label</replaceable>
es: <option>--label=</option><replaceable>etiqueta</replaceable>

source: Use <emphasis remap="I">label</emphasis> instead of the file name in the context format and unified format headers.
es: Emplea <emphasis remap="I">etiqueta</emphasis> en lugar del nombre de fichero en las cabeceras de formatos de contexto y unificación.

source: Print only the left column of two common lines in side by side format.
es: Imprime solamente la columna izquierda de dos líneas comunes en formato de lado a lado.

source: <option>--line-format=</option><replaceable>format</replaceable>
es: <option>--line-format=</option><replaceable>formato</replaceable>

source: Use <emphasis remap="I">format</emphasis> to output all input lines in in-then-else format.
es: Emplea <emphasis remap="I">formato</emphasis> para mostrar en la salida todas las líneas de entrada en formato if-then-else.

source: Output RCS-format diffs; like <option>-f</option> except that each command specifies the number of lines affected.
es: Muestra en la salida diferencias en formato RCS; como la opción <option>-f</option> excepto que cada comando especifica el número de líneas afectadas.

source: In directory comparison, if a file is found in only one directory, treat it as present but empty in the other directory.
es: En comparaciones de directorios, si un fichero se encuentra sólo en un directorio, lo trata como si estuviera presente pero vacío en el otro directorio.

source: <option>--new-group-format=</option><replaceable>format</replaceable>
es: <option>--new-group-format=</option><replaceable>formato</replaceable>

source: Use <emphasis remap="I">format</emphasis> to output a group of lines taken from just the second file in if-then-else format.
es: Emplea <emphasis remap="I">formato</emphasis> para mostrar por salida un grupo de líneas tomadas del segundo fichero únicamente en formato if-then-else.

source: <option>--new-line-format=</option><replaceable>format</replaceable>
es: <option>--new-line-format=</option><replaceable>formato</replaceable>

source: Use <emphasis remap="I">format</emphasis> to output a line taken from just the second file in if-then-else format.
es: Emplea <emphasis remap="I">formato</emphasis> para mostrar por la salida una línea tomada del segundo fichero únicamente, en formato if-then-else.

source: <option>--old-group-format=</option><replaceable>format</replaceable>
es: <option>--old-group-format=</option><replaceable>formato</replaceable>

source: Use <emphasis remap="I">format</emphasis> to output a group of lines taken from just the first file in if-then-else format.
es: Emplea <emphasis remap="I">formato</emphasis> para mostrar por la salida un grupo de líneas tomadas del primer fichero únicamente, en formato if-then-else.

source: <option>--old-line-format=</option><replaceable>format</replaceable>
es: <option>--old-line-format=</option><replaceable>formato</replaceable>

source: Use <emphasis remap="I">format</emphasis> to output a line taken from just the first file in if-then-else format.
es: Emplea <emphasis remap="I">formato</emphasis> para mostrar por la salida una línea tomada del primer fichero únicamente, en formato if-then-else.

source: Show which C function each change is in.
es: Muestra en qué función de C está cada cambio.

source: When comparing directories, if a file appears only in the second directory of the two, treat it as present but empty in the other.
es: Al comparar directorios, si un fichero aparece sólo en el segundo directorio de los dos, se trata como si estuviera presente pero vacío en el otro.

source: When comparing directories, recursively compare any subdirectories found.
es: Al comparar directorios, comparar recursivamente cualquier subdirectorio encontrado.

source: Report when two files are the same.
es: Informa de cuando dos ficheros son iguales.

source: <option>-S </option><emphasis remap="I">file</emphasis>
es: <option>-S </option><emphasis remap="I">fichero</emphasis>

source: When comparing directories, start with the file <emphasis remap="I">file</emphasis>. This is used for resuming an aborted comparison.
es: Al comparar directorios, comienza con el fichero <emphasis remap="I">fichero</emphasis>. Esto se utiliza para reanudar una comparación interrumpida.

source: Print extra information to help <emphasis remap="I">sdiff</emphasis>. <emphasis remap="I">sdiff</emphasis> uses this option when it runs <command>diff</command>. This option is not intended for users to use directly.
es: Imprime información extra para ayudar a <emphasis remap="I">sdiff</emphasis>. <emphasis remap="I">sdiff</emphasis> utiliza esta opción cuando ejecuta <command>diff</command>. Esta opción no está indicada para su uso directo.

source: <option>--show-function-line=</option><replaceable>regexp</replaceable>
es: <option>--show-function-line=</option><replaceable>expreg</replaceable>

source: Use the side by side output format.
es: Emplea el formato de salida de lado a lado.

source: <option>--starting-file=</option><replaceable>file</replaceable>
es: <option>--starting-file=</option><replaceable>fichero</replaceable>

source: Do not print common lines in side by side format.
es: No imprime las líneas comunes en formato de lado a lado.

source: Treat all files as text and compare them line-by-line, even if they do not appear to be text.
es: Trata todos los ficheros y los compara línea a línea, incluso si no parecen ser texto.

source: Use the unified output format.
es: Emplea el formato de salida unificado.

source: <option>--unchanged-group-format=</option><replaceable>format</replaceable>
es: <option>--unchanged-group-format=</option><replaceable>formato</replaceable>

source: Use <emphasis remap="I">format</emphasis> to output a group of common lines taken from both files in if-then-else format.
es: Emplea <emphasis remap="I">formato</emphasis> para mostrar en la salida un grupo de líneas comunes tomadas de ambos fichero en formato if-then-else.

source: <option>--unchanged-line-format=</option><replaceable>format</replaceable>
es: <option>--unchanged-line-format=</option><replaceable>formato</replaceable>

source: Use <emphasis remap="I">format</emphasis> to output a line common to both files in if-then-else format.
es: Emplea <emphasis remap="I">formato</emphasis> para mostrar por la salida una línea común a ambos ficheros en formato if-then-else.

source: <option>-U </option><emphasis remap="I">lines</emphasis>
es: <option>-U </option><emphasis remap="I">líneas</emphasis>

source: <option>--unified[=</option><replaceable>lines</replaceable><emphasis remap="B">]</emphasis>
es: <option>--unified[=</option><replaceable>líneas</replaceable><emphasis remap="B">]</emphasis>

source: Use the unified output format, showing <emphasis remap="I">lines</emphasis> (an integer) lines of context, or three if <emphasis remap="I">lines</emphasis> is not given. For proper operation, <emphasis remap="I">patch</emphasis> typically needs at least two lines of context.
es: Emplea el formato de salida unificado, mostrando <emphasis remap="I">líneas</emphasis> (un entero) líneas de contexto, o tres si <emphasis remap="I">líneas</emphasis> no se da. Para una operación correcta, <emphasis remap="I">patch</emphasis> necesita típicamente al menos dos líneas de contexto.

source: Output the version number of <command>diff</command>.
es: Muestra el número de versión de <command>diff</command>.

source: <option>-W </option><emphasis remap="I">columns</emphasis>
es: <option>-W </option><emphasis remap="I">columnas</emphasis>

source: <option>--width=</option><replaceable>columns</replaceable>
es: <option>--width=</option><replaceable>columnas</replaceable>

source: Use an output width of <emphasis remap="I">columns</emphasis> in side by side format.
es: Emplea una anchura de salida de <emphasis remap="I">columnas</emphasis> en formato de lado a lado.

source: <option>-x </option><emphasis remap="I">pattern</emphasis>
es: <option>-x </option><emphasis remap="I">patrón</emphasis>

source: <option>-X </option><emphasis remap="I">file</emphasis>
es: <option>-X </option><emphasis remap="I">fichero</emphasis>

source: SEE ALSO
es: VÉASE TAMBIÉN

source: DIAGNOSTICS
es: DIAGNÓSTICO

source: An exit status of 0 means no differences were found, 1 means some differences were found, and 2 means trouble.
es: Un estado de salida de 0 significa que no se encontraron diferencias, 1 significa que se encontraron algunas diferencias, y 2 significa problemas.

source: translator-credits
es: Jorge Rodríguez (A.K.A. Tiriel) <tiriel@users.sourceforge.net> 2005-02-17
